content/daily/2022-02-20.md
+++
title = "2022-02-20"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## Today's Plan {#today-s-plan}


### <span class="org-todo done DONE">DONE</span> Get to know the modules {#get-to-know-the-modules}


#### Goal {#goal}

To accomplish good grade in the modules.

Thus, the system of the module content should be examined, the system of university's deliver/teaching should be documented for further use, and a system of me with my own part and use of university's system to know about the module content system should be established.

<!--list-separator-->

-  requirement

    3 systems are to be established. Each will in form of a machine.

    -   Document Module Content System(MCS)
        name: (CPT102-MCS)
        Full of object/goals. Lack action/flow/principle
    -   Document University Teaching System(UTS)
        name: (CPT102-UTS)
        Will include schedule, resource, people to contact to.
        With defined APIs.
        Would imply some methods.
    -   Establish and Document Personal Acquisition System(PAS)
        name: (CPT102-PAS)
        Should include Princiople, Actions.
        Goal fits the goals in MCS.
        Use API from UTS wisely.


#### Actions {#actions}

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  CPT102<code>[2/3]</code> Data structure

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  TDOO MCS<code>[6/7]</code>

        1.  [X] Find a location to store the docs
        2.  [X] Check Module handbook
        3.  [X] Check/Download/organize Current slide/resource
        4.  [X] Define the pattern of resource pull from MCS
        5.  [ ] [optional] Ask for advise from older students
        6.  [X] Add 2 syllabus of the same object from 2 different institutes(to compare to understand)
        7.  [X] Wrap up the MCS with summary and index.

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  UTS<code>[6/8]</code>

        1.  [X] Check Module Handbook
            1.  [X] Deliver plan
            2.  [X] Suggested study method
            3.  [X] Definition of lec/tutorial
        2.  [X] Get Servises(from person) supplyed
        3.  [X] Get Tools(digital/like a server) supplyed
        4.  [X] Summary the teachers, what do they know, how to contect.
        5.  [X] Define the Mechanisms happening officially, and API for me to use them.
        6.  [X] Wrap up the system with summary of Methods in it, and Vars in it.
        7.  [ ] [optional] Ask for advise from older students
        8.  [ ] [optional] other teaching plan from other projects.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  PAS<code>[0/4]</code>

        1.  [ ] Write system specification. with info from MCS and UTS
            1.  [ ] Use learning principles.
            2.  [ ] Solidify the Knowledge(vars)
            3.  [ ] Solidify the Methods. What skills should I be learning, and how should I learn them.
            4.  [ ] Speicify Input and Output overall
            5.  [ ] Use blackbox abstraction to design each little part
        2.  [ ] Write a system that will work together(with a main method), with aid from UTS APIs and targeting data from MCS.
        3.  [ ] Specify Log implementation, when to log, and where the log could be find.
        4.  [ ] Provide APIs. for other systems like Planning machine etc.

    <!--list-separator-->

    -  Outline

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  CPT104<code>[/]</code>

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  MCS<code>[2/6]</code>

        1.  [X] Check Module handbook
        2.  [ ] Check/Download/organize Current slide/resource
        3.  [ ] Define the pattern of resource pull from MCS
        4.  [ ] [optional] Ask for advise from older students
        5.  [X] Add 2 syllabus of the same object from 2 different institutes(to compare to understand)
        6.  [ ] Wrap up the MCS with summary and index.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  UTS<code>[0/8]</code>

        1.  [ ] Check Module Handbook
            1.  [ ] Deliver plan
            2.  [ ] Suggested study method
            3.  [ ] Definition of lec/tutorial
        2.  [ ] Get Servises(from person) supplyed
        3.  [ ] Get Tools(digital/like a server) supplyed
        4.  [ ] Summary the teachers, what do they know, how to contect.
        5.  [ ] Define the Mechanisms happening officially, and API for me to use them.
        6.  [ ] Wrap up the system with summary of Methods in it, and Vars in it.
        7.  [ ] [optional] Ask for advise from older students
        8.  [ ] [optional] other teaching plan from other projects.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  PAS<code>[0/4]</code>

        1.  [ ] Write system specification. with info from MCS and UTS
            1.  [ ] Use learning principles.
            2.  [ ] Solidify the Knowledge(vars)
            3.  [ ] Solidify the Methods. What skills should I be learning, and how should I learn them.
            4.  [ ] Speicify Input and Output overall
            5.  [ ] Use blackbox abstraction to design each little part
        2.  [ ] Write a system that will work together(with a main method), with aid from UTS APIs and targeting data from MCS.
        3.  [ ] Specify Log implementation, when to log, and where the log could be find.
        4.  [ ] Provide APIs. for other systems like Planning machine etc.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  INT102<code>[/]</code>

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  MCS<code>[0/6]</code>

        1.  [ ] Check Module handbook
        2.  [ ] Check/Download/organize Current slide/resource
        3.  [ ] Define the pattern of resource pull from MCS
        4.  [ ] [optional] Ask for advise from older students
        5.  [ ] Add 2 syllabus of the same object from 2 different institutes(to compare to understand)
        6.  [ ] Wrap up the MCS with summary and index.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  UTS<code>[0/8]</code>

        1.  [ ] Check Module Handbook
            1.  [ ] Deliver plan
            2.  [ ] Suggested study method
            3.  [ ] Definition of lec/tutorial
        2.  [ ] Get Servises(from person) supplyed
        3.  [ ] Get Tools(digital/like a server) supplyed
        4.  [ ] Summary the teachers, what do they know, how to contect.
        5.  [ ] Define the Mechanisms happening officially, and API for me to use them.
        6.  [ ] Wrap up the system with summary of Methods in it, and Vars in it.
        7.  [ ] [optional] Ask for advise from older students
        8.  [ ] [optional] other teaching plan from other projects.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  PAS<code>[0/4]</code>

        1.  [ ] Write system specification. with info from MCS and UTS
            1.  [ ] Use learning principles.
            2.  [ ] Solidify the Knowledge(vars)
            3.  [ ] Solidify the Methods. What skills should I be learning, and how should I learn them.
            4.  [ ] Speicify Input and Output overall
            5.  [ ] Use blackbox abstraction to design each little part
        2.  [ ] Write a system that will work together(with a main method), with aid from UTS APIs and targeting data from MCS.
        3.  [ ] Specify Log implementation, when to log, and where the log could be find.
        4.  [ ] Provide APIs. for other systems like Planning machine etc.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  INT104<code>[/]</code>

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  MCS<code>[0/6]</code>

        1.  [ ] Check Module handbook
        2.  [ ] Check/Download/organize Current slide/resource
        3.  [ ] Define the pattern of resource pull from MCS
        4.  [ ] [optional] Ask for advise from older students
        5.  [ ] Add 2 syllabus of the same object from 2 different institutes(to compare to understand)
        6.  [ ] Wrap up the MCS with summary and index.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  UTS<code>[0/8]</code>

        1.  [ ] Check Module Handbook
            1.  [ ] Deliver plan
            2.  [ ] Suggested study method
            3.  [ ] Definition of lec/tutorial
        2.  [ ] Get Servises(from person) supplyed
        3.  [ ] Get Tools(digital/like a server) supplyed
        4.  [ ] Summary the teachers, what do they know, how to contect.
        5.  [ ] Define the Mechanisms happening officially, and API for me to use them.
        6.  [ ] Wrap up the system with summary of Methods in it, and Vars in it.
        7.  [ ] [optional] Ask for advise from older students
        8.  [ ] [optional] other teaching plan from other projects.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  PAS<code>[0/4]</code>

        1.  [ ] Write system specification. with info from MCS and UTS
            1.  [ ] Use learning principles.
            2.  [ ] Solidify the Knowledge(vars)
            3.  [ ] Solidify the Methods. What skills should I be learning, and how should I learn them.
            4.  [ ] Speicify Input and Output overall
            5.  [ ] Use blackbox abstraction to design each little part
        2.  [ ] Write a system that will work together(with a main method), with aid from UTS APIs and targeting data from MCS.
        3.  [ ] Specify Log implementation, when to log, and where the log could be find.
        4.  [ ] Provide APIs. for other systems like Planning machine etc.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  SPA003<code>[/]</code>

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  MCS<code>[0/6]</code>

        1.  [ ] Check Module handbook
        2.  [ ] Check/Download/organize Current slide/resource
        3.  [ ] Define the pattern of resource pull from MCS
        4.  [ ] [optional] Ask for advise from older students
        5.  [ ] Add 2 syllabus of the same object from 2 different institutes(to compare to understand)
        6.  [ ] Wrap up the MCS with summary and index.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  UTS<code>[0/8]</code>

        1.  [ ] Check Module Handbook
            1.  [ ] Deliver plan
            2.  [ ] Suggested study method
            3.  [ ] Definition of lec/tutorial
        2.  [ ] Get Servises(from person) supplyed
        3.  [ ] Get Tools(digital/like a server) supplyed
        4.  [ ] Summary the teachers, what do they know, how to contect.
        5.  [ ] Define the Mechanisms happening officially, and API for me to use them.
        6.  [ ] Wrap up the system with summary of Methods in it, and Vars in it.
        7.  [ ] [optional] Ask for advise from older students
        8.  [ ] [optional] other teaching plan from other projects.

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  PAS<code>[0/4]</code>

        1.  [ ] Write system specification. with info from MCS and UTS
            1.  [ ] Use learning principles.
            2.  [ ] Solidify the Knowledge(vars)
            3.  [ ] Solidify the Methods. What skills should I be learning, and how should I learn them.
            4.  [ ] Speicify Input and Output overall
            5.  [ ] Use blackbox abstraction to design each little part
        2.  [ ] Write a system that will work together(with a main method), with aid from UTS APIs and targeting data from MCS.
        3.  [ ] Specify Log implementation, when to log, and where the log could be find.
        4.  [ ] Provide APIs. for other systems like Planning machine etc.


#### Log {#log}

I made decisions on what to do to make MCS,UTS,PAS settled.

Maybe I should reexamine these 3 systems in a while.

The ultimate result of the 3 systems should be data in data structures.

Reading irrelevent material(for current task). Should just skip for now

I first decided to spend 1 hour on each subject, but it seems to short. I spend 2 hour on 1 MCS. So I guess that's the real speed.

2 module each day. 2 hour for MCS, 0.5 hour for UTS.